import {
  __commonJS
} from "./chunk-BUSYA2B4.js";

// ../../../../node_modules/@homegrown/word-counter/dist/emojiPattern.js
var require_emojiPattern = __commonJS({
  "../../../../node_modules/@homegrown/word-counter/dist/emojiPattern.js"(exports) {
    "use strict";
    Object.defineProperty(exports, "__esModule", { value: true });
    exports.default = "🏴󠁧󠁢(?:󠁷󠁬󠁳|󠁳󠁣󠁴|󠁥󠁮󠁧)󠁿|(?:🧑🏿‍❤(?:️‍(?:💋‍)?|‍(?:💋‍)?)🧑|👩🏿‍🤝‍[👨👩]|🫱🏿‍🫲)[🏻-🏾]|(?:🧑🏾‍❤(?:️‍(?:💋‍)?|‍(?:💋‍)?)🧑|👩🏾‍🤝‍[👨👩]|🫱🏾‍🫲)[🏻-🏽🏿]|(?:🧑🏽‍❤(?:️‍(?:💋‍)?|‍(?:💋‍)?)🧑|👩🏽‍🤝‍[👨👩]|🫱🏽‍🫲)[🏻🏼🏾🏿]|(?:🧑🏼‍❤(?:️‍(?:💋‍)?|‍(?:💋‍)?)🧑|👩🏼‍🤝‍[👨👩]|🫱🏼‍🫲)[🏻🏽-🏿]|(?:🧑🏻‍❤(?:️‍(?:💋‍)?|‍(?:💋‍)?)🧑|👩🏻‍🤝‍[👨👩]|🫱🏻‍🫲)[🏼-🏿]|👨(?:🏻(?:‍(?:❤(?:️‍(?:💋‍👨[🏻-🏿]|👨[🏻-🏿])|‍(?:💋‍👨[🏻-🏿]|👨[🏻-🏿]))|🤝‍👨[🏼-🏿]|[⚕⚖✈]️|[⚕⚖✈]|[🌾🍳🍼🎓🎤🎨🏫🏭💻💼🔧🔬🚀🚒🦯-🦳🦼🦽]))?|[🏼-🏿]‍❤(?:️‍(?:💋‍👨[🏻-🏿]|👨[🏻-🏿])|‍(?:💋‍👨[🏻-🏿]|👨[🏻-🏿]))|‍(?:❤(?:️‍(?:💋‍)?|‍(?:💋‍)?)👨|[👨👩]‍(?:👦‍👦|👧‍[👦👧])|👦‍👦|👧‍[👦👧]|[🌾🍳🍼🎓🎤🎨🏫🏭💻💼🔧🔬🚀🚒🦯-🦳🦼🦽])|🏿‍(?:🤝‍👨[🏻-🏾]|[🌾🍳🍼🎓🎤🎨🏫🏭💻💼🔧🔬🚀🚒🦯-🦳🦼🦽])|🏾‍(?:🤝‍👨[🏻-🏽🏿]|[🌾🍳🍼🎓🎤🎨🏫🏭💻💼🔧🔬🚀🚒🦯-🦳🦼🦽])|🏽‍(?:🤝‍👨[🏻🏼🏾🏿]|[🌾🍳🍼🎓🎤🎨🏫🏭💻💼🔧🔬🚀🚒🦯-🦳🦼🦽])|🏼‍(?:🤝‍👨[🏻🏽-🏿]|[🌾🍳🍼🎓🎤🎨🏫🏭💻💼🔧🔬🚀🚒🦯-🦳🦼🦽])|(?:🏿‍[⚕⚖✈]|🏾‍[⚕⚖✈]|🏽‍[⚕⚖✈]|🏼‍[⚕⚖✈]|‍[⚕⚖✈])️|‍(?:[👨👩]‍[👦👧]|[👦👧])|🏿‍[⚕⚖✈]|🏾‍[⚕⚖✈]|🏽‍[⚕⚖✈]|🏼‍[⚕⚖✈]|🏿|🏾|🏽|🏼|‍[⚕⚖✈])?|(?:👩(?:🏻‍❤(?:️‍(?:💋‍[👨👩]|[👨👩])|‍(?:💋‍[👨👩]|[👨👩]))|[🏼-🏿]‍❤(?:️‍(?:💋‍[👨👩]|[👨👩])|‍(?:💋‍[👨👩]|[👨👩])))|🧑[🏻-🏿]‍🤝‍🧑)[🏻-🏿]|👩‍👩‍(?:👦‍👦|👧‍[👦👧])|👩(?:‍(?:❤(?:️‍(?:💋‍[👨👩]|[👨👩])|‍(?:💋‍[👨👩]|[👨👩]))|[🌾🍳🍼🎓🎤🎨🏫🏭💻💼🔧🔬🚀🚒🦯-🦳🦼🦽])|🏿‍[🌾🍳🍼🎓🎤🎨🏫🏭💻💼🔧🔬🚀🚒🦯-🦳🦼🦽]|🏾‍[🌾🍳🍼🎓🎤🎨🏫🏭💻💼🔧🔬🚀🚒🦯-🦳🦼🦽]|🏽‍[🌾🍳🍼🎓🎤🎨🏫🏭💻💼🔧🔬🚀🚒🦯-🦳🦼🦽]|🏼‍[🌾🍳🍼🎓🎤🎨🏫🏭💻💼🔧🔬🚀🚒🦯-🦳🦼🦽]|🏻‍[🌾🍳🍼🎓🎤🎨🏫🏭💻💼🔧🔬🚀🚒🦯-🦳🦼🦽])|🧑(?:‍(?:🤝‍🧑|[🌾🍳🍼🎄🎓🎤🎨🏫🏭💻💼🔧🔬🚀🚒🦯-🦳🦼🦽])|🏿‍[🌾🍳🍼🎄🎓🎤🎨🏫🏭💻💼🔧🔬🚀🚒🦯-🦳🦼🦽]|🏾‍[🌾🍳🍼🎄🎓🎤🎨🏫🏭💻💼🔧🔬🚀🚒🦯-🦳🦼🦽]|🏽‍[🌾🍳🍼🎄🎓🎤🎨🏫🏭💻💼🔧🔬🚀🚒🦯-🦳🦼🦽]|🏼‍[🌾🍳🍼🎄🎓🎤🎨🏫🏭💻💼🔧🔬🚀🚒🦯-🦳🦼🦽]|🏻‍[🌾🍳🍼🎄🎓🎤🎨🏫🏭💻💼🔧🔬🚀🚒🦯-🦳🦼🦽])|👩‍👦‍👦|👩‍👩‍[👦👧]|👩‍👧‍[👦👧]|(?:👁️?‍🗨|🧑(?:🏿‍[⚕⚖✈]|🏾‍[⚕⚖✈]|🏽‍[⚕⚖✈]|🏼‍[⚕⚖✈]|🏻‍[⚕⚖✈]|‍[⚕⚖✈])|👩(?:🏿‍[⚕⚖✈]|🏾‍[⚕⚖✈]|🏽‍[⚕⚖✈]|🏼‍[⚕⚖✈]|🏻‍[⚕⚖✈]|‍[⚕⚖✈])|😶‍🌫|🏳️?‍⚧|🐻‍❄|(?:[🏃🏄🏊👮👰👱👳👷💁💂💆💇🙅-🙇🙋🙍🙎🚣🚴-🚶🤦🤵🤷-🤹🤽🤾🦸🦹🧍-🧏🧔🧖-🧝][🏻-🏿]|[👯🧞🧟])‍[♀♂]|[⛹🏋🏌🕵](?:[️🏻-🏿]‍[♀♂]|‍[♀♂])|🏴‍☠|[🏃🏄🏊👮👰👱👳👷💁💂💆💇🙅-🙇🙋🙍🙎🚣🚴-🚶🤦🤵🤷-🤹🤼-🤾🦸🦹🧍-🧏🧔🧖-🧝]‍[♀♂]|[©®‼⁉™ℹ↔-↙↩↪⌚⌛⌨⏏⏭-⏯⏱⏲⏸-⏺Ⓜ▪▫▶◀◻◼◾☀-☄☎☑☔☕☘☠☢☣☦☪☮☯☸-☺♀♂♈-♓♟♠♣♥♦♨♻♾♿⚒⚔-⚗⚙⚛⚜⚠⚧⚪⚰⚱⚽⚾⛄⛈⛏⛑⛓⛩⛰-⛵⛷⛸⛺✂✈✉✏✒✔✖✝✡✳✴❄❇❣➡⤴⤵⬅-⬇⬛⬜⭕〰〽㊗㊙🀄🅰🅱🅾🅿🈂🈷🌡🌤-🌬🌶🍽🎖🎗🎙-🎛🎞🎟🏍🏎🏔-🏟🏵🏷🐿📽🕉🕊🕯🕰🕳🕶-🕹🖇🖊-🖍🖥🖨🖱🖲🖼🗂-🗄🗑-🗓🗜-🗞🗡🗣🗨🗯🗳🗺🛋🛍-🛏🛠-🛥🛩🛰🛳])️|👁️?‍🗨|🧑(?:🏿‍[⚕⚖✈]|🏾‍[⚕⚖✈]|🏽‍[⚕⚖✈]|🏼‍[⚕⚖✈]|🏻‍[⚕⚖✈]|‍[⚕⚖✈])|👩(?:🏿‍[⚕⚖✈]|🏾‍[⚕⚖✈]|🏽‍[⚕⚖✈]|🏼‍[⚕⚖✈]|🏻‍[⚕⚖✈]|‍[⚕⚖✈])|🏳️?‍🌈|👩‍👧|👩‍👦|😶‍🌫|🏳️?‍⚧|😵‍💫|😮‍💨|🐕‍🦺|🫱(?:🏿|🏾|🏽|🏼|🏻)?|🧑(?:🏿|🏾|🏽|🏼|🏻)?|👩(?:🏿|🏾|🏽|🏼|🏻)?|🐻‍❄|(?:[🏃🏄🏊👮👰👱👳👷💁💂💆💇🙅-🙇🙋🙍🙎🚣🚴-🚶🤦🤵🤷-🤹🤽🤾🦸🦹🧍-🧏🧔🧖-🧝][🏻-🏿]|[👯🧞🧟])‍[♀♂]|[⛹🏋🏌🕵](?:[️🏻-🏿]‍[♀♂]|‍[♀♂])|🏴‍☠|🇽🇰|🇶🇦|🇴🇲|🐈‍⬛|❤(?:️‍[🔥🩹]|‍[🔥🩹])|👁️?|🏳️?|[🏃🏄🏊👮👰👱👳👷💁💂💆💇🙅-🙇🙋🙍🙎🚣🚴-🚶🤦🤵🤷-🤹🤼-🤾🦸🦹🧍-🧏🧔🧖-🧝]‍[♀♂]|🇿[🇦🇲🇼]|🇾[🇪🇹]|🇼[🇫🇸]|🇻[🇦🇨🇪🇬🇮🇳🇺]|🇺[🇦🇬🇲🇳🇸🇾🇿]|🇹[🇦🇨🇩🇫-🇭🇯-🇴🇷🇹🇻🇼🇿]|🇸[🇦-🇪🇬-🇴🇷-🇹🇻🇽-🇿]|🇷[🇪🇴🇸🇺🇼]|🇵[🇦🇪-🇭🇰-🇳🇷-🇹🇼🇾]|🇳[🇦🇨🇪-🇬🇮🇱🇴🇵🇷🇺🇿]|🇲[🇦🇨-🇭🇰-🇿]|🇱[🇦-🇨🇮🇰🇷-🇻🇾]|🇰[🇪🇬-🇮🇲🇳🇵🇷🇼🇾🇿]|🇯[🇪🇲🇴🇵]|🇮[🇨-🇪🇱-🇴🇶-🇹]|🇭[🇰🇲🇳🇷🇹🇺]|🇬[🇦🇧🇩-🇮🇱-🇳🇵-🇺🇼🇾]|🇫[🇮-🇰🇲🇴🇷]|🇪[🇦🇨🇪🇬🇭🇷-🇺]|🇩[🇪🇬🇯🇰🇲🇴🇿]|🇨[🇦🇨🇩🇫-🇮🇰-🇵🇷🇺-🇿]|🇧[🇦🇧🇩-🇯🇱-🇴🇶-🇹🇻🇼🇾🇿]|🇦[🇨-🇬🇮🇱🇲🇴🇶-🇺🇼🇽🇿]|[#*0-9]️?⃣|🤼[🏻-🏿]|❤️?|[🏃🏄🏊👮👰👱👳👷💁💂💆💇🙅-🙇🙋🙍🙎🚣🚴-🚶🤦🤵🤷-🤹🤽🤾🦸🦹🧍-🧏🧔🧖-🧝][🏻-🏿]|[⛹🏋🏌🕵][️🏻-🏿]?|🏴|[✊✋🎅🏂🏇👂👃👆-👐👦👧👫-👭👲👴-👶👸👼💃💅💏💑💪🕺🖕🖖🙌🙏🛀🛌🤌🤏🤘-🤟🤰-🤴🤶🥷🦵🦶🦻🧒🧓🧕🫃-🫅🫰🫲-🫶][🏻-🏿]|[☝✌✍🕴🖐][️🏻-🏿]|[☝✊-✍🎅🏂🏇🐈🐕🐻👂👃👆-👐👦👧👫-👭👲👴-👶👸👼💃💅💏💑💪🕴🕺🖐🖕🖖😮😵😶🙌🙏🛀🛌🤌🤏🤘-🤟🤰-🤴🤶🤼🥷🦵🦶🦻🧒🧓🧕🫃-🫅🫰🫲-🫶]|[🏃🏄🏊👮👰👱👳👷💁💂💆💇🙅-🙇🙋🙍🙎🚣🚴-🚶🤦🤵🤷-🤹🤽🤾🦸🦹🧍-🧏🧔🧖-🧝]|[👯🧞🧟]|[©®‼⁉™ℹ↔-↙↩↪⌚⌛⌨⏏⏭-⏯⏱⏲⏸-⏺Ⓜ▪▫▶◀◻◼◾☀-☄☎☑☔☕☘☠☢☣☦☪☮☯☸-☺♀♂♈-♓♟♠♣♥♦♨♻♾♿⚒⚔-⚗⚙⚛⚜⚠⚧⚪⚰⚱⚽⚾⛄⛈⛏⛑⛓⛩⛰-⛵⛷⛸⛺✂✈✉✏✒✔✖✝✡✳✴❄❇❣➡⤴⤵⬅-⬇⬛⬜⭕〰〽㊗㊙🀄🅰🅱🅾🅿🈂🈷🌡🌤-🌬🌶🍽🎖🎗🎙-🎛🎞🎟🏍🏎🏔-🏟🏵🏷🐿📽🕉🕊🕯🕰🕳🕶-🕹🖇🖊-🖍🖥🖨🖱🖲🖼🗂-🗄🗑-🗓🗜-🗞🗡🗣🗨🗯🗳🗺🛋🛍-🛏🛠-🛥🛩🛰🛳]|[⏩-⏬⏰⏳◽⚓⚡⚫⛅⛎⛔⛪⛽✅✨❌❎❓-❕❗➕-➗➰➿⭐🃏🆎🆑-🆚🈁🈚🈯🈲-🈶🈸-🈺🉐🉑🌀-🌠🌭-🌵🌷-🍼🍾-🎄🎆-🎓🎠-🏁🏅🏆🏈🏉🏏-🏓🏠-🏰🏸-🐇🐉-🐔🐖-🐺🐼-🐾👀👄👅👑-👥👪👹-👻👽-💀💄💈-💎💐💒-💩💫-📼📿-🔽🕋-🕎🕐-🕧🖤🗻-😭😯-😴😷-🙄🙈-🙊🚀-🚢🚤-🚳🚷-🚿🛁-🛅🛐-🛒🛕-🛗🛝-🛟🛫🛬🛴-🛼🟠-🟫🟰🤍🤎🤐-🤗🤠-🤥🤧-🤯🤺🤿-🥅🥇-🥶🥸-🦴🦷🦺🦼-🧌🧐🧠-🧿🩰-🩴🩸-🩼🪀-🪆🪐-🪬🪰-🪺🫀-🫂🫐-🫙🫠-🫧]";
  }
});

// ../../../../node_modules/@homegrown/word-counter/dist/index.js
var require_dist = __commonJS({
  "../../../../node_modules/@homegrown/word-counter/dist/index.js"(exports) {
    var __importDefault = exports && exports.__importDefault || function(mod) {
      return mod && mod.__esModule ? mod : { "default": mod };
    };
    Object.defineProperty(exports, "__esModule", { value: true });
    exports.count = exports.countCharacters = exports.countLines = exports.countWords = void 0;
    var emojiPattern_1 = __importDefault(require_emojiPattern());
    var cjkPattern = "\\p{Script=Han}|\\p{Script=Kana}|\\p{Script=Hira}|\\p{Script=Hangul}";
    var PatternString = {
      emoji: emojiPattern_1.default,
      cjk: cjkPattern,
      word: `((?!${cjkPattern})[\\p{Alphabetic}\\p{Decimal_Number}\\p{Connector_Punctuation}\\p{Join_Control}])+`,
      number: "(?:[\\p{Decimal_Number}](?:\\.?\\p{Decimal_Number})+)"
    };
    var wordPattern = new RegExp(`${PatternString.emoji}|${PatternString.cjk}|${PatternString.number}|${PatternString.word}`, "gu");
    var characterPattern = new RegExp(`${PatternString.emoji}|\\S`, "ug");
    var characterPatternWithSpace = new RegExp(`${PatternString.emoji}|.`, "ug");
    var countWords = (text) => {
      var _a, _b;
      return (_b = (_a = text.normalize().match(wordPattern)) === null || _a === void 0 ? void 0 : _a.length) !== null && _b !== void 0 ? _b : 0;
    };
    exports.countWords = countWords;
    var countLines = (text) => {
      var _a;
      return (_a = text.split("\n").length) !== null && _a !== void 0 ? _a : 0;
    };
    exports.countLines = countLines;
    var countCharacters = (text, withSpace = false) => {
      var _a, _b;
      return (_b = (_a = text.normalize().match(withSpace ? characterPatternWithSpace : characterPattern)) === null || _a === void 0 ? void 0 : _a.length) !== null && _b !== void 0 ? _b : 0;
    };
    exports.countCharacters = countCharacters;
    var count = (text) => {
      return {
        words: (0, exports.countWords)(text),
        lines: (0, exports.countLines)(text),
        characters: (0, exports.countCharacters)(text),
        charactersWithSpaces: (0, exports.countCharacters)(text, true)
      };
    };
    exports.count = count;
  }
});
export default require_dist();
//# sourceMappingURL=@homegrown_word-counter.js.map
